Revit 2027 API
FabricationDimensionUnitType Enumeration
 Fabrication dimension unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationDimensionUnitType
Public Enumeration FabricationDimensionUnitType
public enum class FabricationDimensionUnitType
type FabricationDimensionUnitType
Members
Member name | Value | Description
Angular | 2 |  Angular.
Linear | 1 |  Linear.
NoUnits | 0 |  NoUnits.
See Also
Reference
Autodesk.Revit.DB Namespace